EDT/УТ/src/InformationRegisters/зпТарификацияЗППоЗаказам/зпТарификацияЗППоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>зпТарификацияЗППоЗаказам</name>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СхемаРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпСхемыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпТарифыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеНачисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоставЭкипажа</name>
    <type>
      <types>EnumRef.зпСоставЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияЗаказа</name>
    <type>
      <types>CatalogRef.зпКатегорииЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.зпЗоныДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/зпВидыНачислений/зпВидыНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>зпВидыНачислений</name>
  <enumValues>
    <name>ОсновноеНачисление</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеНачисление</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/зпСхемыРасчетаЗП/зпСхемыРасчетаЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>зпСхемыРасчетаЗП</name>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРедактирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаВидовПолигоновПарковки</name>
    <type>
      <types>CatalogRef.зпСхемыВидовПолигоновПарковки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПолигоновПарковкиСтандарт</name>
    <type>
      <types>CatalogRef.зпВидыПолигоновПарковки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПолигоновПарковкиПовышеннаяОплата</name>
    <type>
      <types>CatalogRef.зпВидыПолигоновПарковки</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СхемыКатегорийЗаказов</name>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>СхемаКатегорий</name>
      <type>
        <types>CatalogRef.зпСхемыКатегорийЗаказов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СхемыЗонДоставки</name>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>СхемаЗон</name>
      <type>
        <types>CatalogRef.зпСхемыЗонДоставки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/зпТарификацияЗППоЗаказам/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьВозможныеТипыЗаказов();
	ЗаполнитьКатегорииЗаказов();
	ЗаполнитьЗоныДоставки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВозможныеТипыЗаказов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.ТипЗаказа КАК ТипЗаказа
	|ИЗ
	|	(ВЫБРАТЬ
	|		зпСхемыРасчетаЗПСхемыКатегорийЗаказов.ТипЗаказа КАК ТипЗаказа
	|	ИЗ
	|		Справочник.зпСхемыРасчетаЗП.СхемыКатегорийЗаказов КАК зпСхемыРасчетаЗПСхемыКатегорийЗаказов
	|	ГДЕ
	|		зпСхемыРасчетаЗПСхемыКатегорийЗаказов.Ссылка = &СхемаРасчетаЗП
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		зпСхемыРасчетаЗПСхемыЗонДоставки.ТипЗаказа
	|	ИЗ
	|		Справочник.зпСхемыРасчетаЗП.СхемыЗонДоставки КАК зпСхемыРасчетаЗПСхемыЗонДоставки
	|	ГДЕ
	|		зпСхемыРасчетаЗПСхемыЗонДоставки.Ссылка = &СхемаРасчетаЗП) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("СхемаРасчетаЗП", 			Запись.СхемаРасчетаЗП);
	Запрос.УстановитьПараметр("ТаблСхемыКатегорийЗаказов", 	Запись.СхемаРасчетаЗП.СхемыКатегорийЗаказов.ВыгрузитьКолонку("СхемаКатегорий"));
	Запрос.УстановитьПараметр("ТаблСхемыЗонДоставки", 		Запись.СхемаРасчетаЗП.СхемыЗонДоставки.ВыгрузитьКолонку("СхемаЗон"));
	
	Элементы.ТипЗаказа.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТипЗаказа"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКатегорииЗаказов()
	
	Элементы.КатегорияЗаказа.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	зпКатегорииЗаказов.Ссылка КАК КатегорияЗаказа
	|ИЗ
	|	Справочник.зпКатегорииЗаказов КАК зпКатегорииЗаказов
	|ГДЕ
	|	зпКатегорииЗаказов.Владелец В (&ТаблСхемыКатегорийЗаказов)
	|	И зпКатегорииЗаказов.Владелец.ТипЗаказа = &ТипЗаказа";
	
	Запрос.УстановитьПараметр("ТаблСхемыКатегорийЗаказов", 	Запись.СхемаРасчетаЗП.СхемыКатегорийЗаказов.ВыгрузитьКолонку("СхемаКатегорий"));
	Запрос.УстановитьПараметр("ТипЗаказа", Запись.ТипЗаказа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблКатегорииЗаказов = РезультатЗапроса.Выгрузить();
	Для Каждого строкаТабл Из ТаблКатегорииЗаказов Цикл 
		Элементы.КатегорияЗаказа.СписокВыбора.Добавить(строкаТабл.КатегорияЗаказа);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗоныДоставки()
	
	Элементы.ЗонаДоставки.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	зпЗоныДоставки.Ссылка КАК ЗонаДоставки
	|ИЗ
	|	Справочник.зпЗоныДоставки КАК зпЗоныДоставки
	|ГДЕ
	|	зпЗоныДоставки.Владелец В(&ТаблСхемыЗонДоставки)
	|	И зпЗоныДоставки.Владелец.ТипЗаказа = &ТипЗаказа";
	
	Запрос.УстановитьПараметр("ТаблСхемыЗонДоставки", Запись.СхемаРасчетаЗП.СхемыЗонДоставки.ВыгрузитьКолонку("СхемаЗон"));
	Запрос.УстановитьПараметр("ТипЗаказа", Запись.ТипЗаказа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблЗоныДоставки = РезультатЗапроса.Выгрузить();
	Для Каждого строкаТабл Из ТаблЗоныДоставки Цикл 
		Элементы.ЗонаДоставки.СписокВыбора.Добавить(строкаТабл.ЗонаДоставки);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВозможныеОсновныеНачисления()
	
	Элементы.ЗонаДоставки.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	зпНачисления.Ссылка КАК Нач
	|ИЗ
	|	Справочник.зпНачисления КАК зпНачисления
	|ГДЕ
	|	зпНачисления.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.зпВидыНачислений.ОсновноеНачисление)";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыбН = РезультатЗапроса.Выбрать();
	Пока ВыбН.Следующий() Цикл
		Элементы.ОсновноеНачисление.СписокВыбора.Добавить(ВыбН.Нач);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ТипЗаказаПриИзменении(Элемент)
	ЗаполнитьКатегорииЗаказов();
	ЗаполнитьЗоныДоставки();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЭтотОбъект.Запись.Должность = ЭтотОбъект.Запись.Роль;
	
КонецПроцедуры
